ELSPL/STM32F4-Dev/Example Projects/Core Feature/Eg5/Drivers/BSP/stm32f4_discovery_rtc.c
      if(digit == 0)
      {
        uErase_SemiColon();
        digit = 1;                /* now its point to 2nd digit */
        State--;                  /* point to one up state */
        count--;                  /* decrement character count */
        continue;
      }
      else
      {
        if(TimeFlag == 1)
        {
          uErase_Char_With_UnderScore();
          TimeFlag = 0;          /* changed mind so not ready */
          digit = 1;             /* point to 2nd digit */
          count--;               /* decrement count */
          continue;              /* goback and get another input */
        }

        uErase_Char_With_UnderScore();

        digit = 0;               /* now its point to 1st digit */
        count--;                 /* decrement character count */
        continue;
      }
    }
    else if (cp>= '0' && cp <='9')/* is character between 0 to 9? */
    {
      RTCdata = cp;
      /*********** check hours **********/
      if(count < MaxCount)
      {
        if(State == 0)
        {
          if(digit == 0)
          {
            uprintf("%c",RTCdata);     /* echo 1st character */
            AsciiMSB = RTCdata;        /* store 1st byte MSB  */
            count++;                   /* increment character count,will be 1 */
            digit++;                   /* increment digit, will be 1 */
            continue;
          }
          else
          {
            uprintf("%c", RTCdata);               /* echo 2nd character */
            AsciiLSB = RTCdata;                   /* store 2nd byte LSB  */
            RTCdata = ((AsciiMSB & 0x0F) * 10);   /* store nibble */
            RTCdata += (AsciiLSB & 0x0F);         /* add to nibble, integer */

            if(RTCdata <=23)                      /* check hour range ( 0-23) */
            {
              T.Hours = RTCdata;                  /* store hh in time buffer */

              State++;                            /* increment to mm state */
              count++;                            /* increment character count,will be 2 */
              digit = 0;                          /* set digit to zero  */

              uprintf(":");                       /* and write ':' on the screen */
              continue;                           /* continue for minutes */
            }
            else
            {
              uErase_And_RingTheBell();
              continue;
            }
          }
        }

        /********** check minutes ***********/
        if(State == 1)
        {
          if(digit==0)
          {
            uprintf("%c", RTCdata);         /* echo 1st character */
            AsciiMSB = RTCdata;             /* store 1st byte MSB  */
            count++;                        /* increment character count,will be 3 */
            digit++;                        /* increment digit, will be 1  */
            continue;
          }
          else
          {
            uprintf("%c", RTCdata);             /* echo 2nd character */
            AsciiLSB = RTCdata;                 /* store 2nd byte LSB  */
            RTCdata = ((AsciiMSB & 0x0F) * 10); /* store nibble */
            RTCdata += (AsciiLSB & 0x0F);       /* add to nibble, integer */

            if(RTCdata <=59)                    /* check minutes range ( 0-59) */
            {
              T.Minutes = RTCdata;              /* store mm in time buffer */
              State++;                          /* increment to ss state */
              count++;                          /* increment character count,will be 4 */
              digit = 0;                        /* set digit to zero  */
              uprintf(":");                     /* and write ':' on the screen */

              continue;                         /* continue for seconds */
            }
            else
            {
              uErase_And_RingTheBell();
              continue;
            }
          }
        }

        /*********** check seconds ***************/
        if(State == 2)
        {
          if(digit==0)
          {
            uprintf("%c", RTCdata);         /* echo 1st character */
            AsciiMSB = RTCdata;             /* store 1st byte MSB  */
            count++;                        /* increment character count,will be 5 */
            digit++;                        /* increment digit no.  */

            continue;
          }
          else
          {
            uprintf("%c", RTCdata);              /* echo 2nd character */
            AsciiLSB = RTCdata;                  /* store 2nd byte LSB  */
            RTCdata = ((AsciiMSB & 0x0F) * 10);  /* store nibble */
            RTCdata += (AsciiLSB & 0x0F);        /* add to nibble, integer */

            if(RTCdata <=59)                     /* check seconds range ( 0-59) */
            {
              T.Seconds = RTCdata;               /* store ss in time buffer */

              TimeFlag = 1;                      /* Time data is ready for RTC */
              count++;                           /* increment character count,will be 6 */

              continue;                          /* go back and find the decision  */
            }
            else
            {
              uErase_And_RingTheBell();
              continue;
            }
          }
        }

        continue;                                /* number of char is more than read */
        /* so go back to find the decision */
      }
      /*************************************************/
      else
      {
        uprintf("%c", cp);                       /* echo character */
        uErase_Char_With_UnderScore();
        uprintf("\7");                           /* ring the bell */

        continue;
      }
    }
  }
  return(0);
}


/**
 * @brief Check if the entered year is leap year or not
 * @param Year      Only provide last two digits of Year (2015 = 15)
 * @param Century   Provide the Century-1 (2015 = 21-1 = 20)
 * @return status
 */
uint8_t Is_Leap_Year(uint16_t Year, uint16_t Century)
{
  /* If year not a multiple of 4 then not a leap year */
  if( (Year % 4) != 0) return NO;

  /* If year a multiple of 4 and non zero then is a leap year */
  if(Year != 0) return YES;

  /* Must check the century is a multiple of 4 also */
  return ((Century % 4) == 0);
}


/**
 * @brief It asks user to change Date
 * @return status
 */
uint8_t BSP_RTC_Change_Date (void)
{
  uint8_t DaysPerMonth[12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
  RTC_DateTypeDef D;
  D.WeekDay = RTC_WEEKDAY_MONDAY;
  D.Month = RTC_MONTH_MAY;
  D.Date = 1;
  D.Year = 00;
  uint8_t Daysthismonth;
  uint8_t DateBuffer[1];
  char cp;                               /* input from keyboard */
  char RTCdata;                          /* buffer */
  uint8_t DateFlag=0;                    /* flag for date data is available */
  uint8_t count = 0;                     /* input character counter */
  uint8_t State = 0;                     /* state for dd=1, mm=2, ccyy=3 */

  uint8_t digit = 0;                     /* indication for 1st, 2nd, 3rd and 4th digit */
                                         /* for dd, mm, yycc */
  uint8_t MaxCount = 8;                  /* maximum no. of digits */
  char AsciiLSB;                         /* temp storage for LSB ascii input */
  char AsciiMSB;                         /* temp storage for MSB ascii input */
  uint8_t DaysThisMonth;                 /* number of days for the given month */

    while(1)
    {
      cp = ugetche(BLOCKING);                    /* get input character */

      if(cp == In_ESC)                   /* if ESCAPE pressed then exit */
      {
        return (cp);
      }
      else if (cp == In_CR)              /* CARRIAGE RETURN ? */
      {
        if(count==0)                     /* any characters at all ? */
        {
          continue;                      /* no, so get another character */
        }

        if(DateFlag==1)
        {   /*  update real time clock  */
          /* Read RTC */
          Year[0] = ((DateBuffer[0] & 0xFF) * 100);
          Year[0] += (DateBuffer[1] & 0xFF);
          D.Year = DateBuffer[1];
          HAL_RTC_SetDate(&hrtc_bsp, &D, FORMAT_BIN);
          return(0);
        }
        else
        {
          break;                       /* check for any character */
        }
      }
      else if (cp == In_DELETE || cp == In_BACKSPACE) /* delete or back space */
      {
        if(count==0)                   /* any characters entered */
        {
          continue;                    /* no, so get another character */
        }

