ELSPL/STM32F4-Dev/Example Projects/Core Feature/Eg5/Drivers/BSP/stm32f4_discovery_rtc.c
        if(State == 2)                 /* State 2 contains 4 digits */
        {
          if(digit == 0)
          {
            uErase_Backslash();
            digit = 1;                 /* now its point to 2nd digit of month */
            State--;                   /* point to month's state */
            count--;                   /* decrement character count */

            continue;
          }
          else
          {
            uErase_Char_With_UnderScore();
            digit--;                     /* point to 2nd digit */
            count--;                     /* decrement count */

            continue;                    /* go back and get another input */
          }
        }
        else
        {
          if(digit ==0)
          {
            uErase_Backslash();
            State--;                     /* point to month's state */
            digit = 1;                   /* now its point to 2nd digit of month */
            count--;                     /* decrement character count */

            continue;
          }
          else
          {
            uErase_Char_With_UnderScore();
            digit = 0;                   /* point to 1st digit */
            count--;                     /* decrement count */

            continue;                    /* goback and get another input */
          }
        }
      }
      else if (cp>= '0' && cp <='9')     /* is character between 0 to 9? */
      {
        RTCdata = cp;

        /****** check date ****/
        if(count < MaxCount)
        {
          if(State == 0)
          {
            if(digit==0)
            {
              uprintf("%c", RTCdata);    /* echo 1st character */
              AsciiMSB = RTCdata;        /* store 1st byte MSB  */
              count++;                   /* increment character count,will be 1 */
              digit++;                   /* increment digit, will be 1 */

              continue;
            }
            else
            {
              uprintf("%c", RTCdata);             /* echo 2nd character */
              AsciiLSB = RTCdata;                 /* store 2nd byte LSB  */
              RTCdata = ((AsciiMSB & 0x0F) * 10); /* store nibble */
              RTCdata += (AsciiLSB & 0x0F);       /* add to nibble, integer */

              if(RTCdata >= 1 && RTCdata <=31)    /* check date range ( 1-31) */
              {
                D.Date = RTCdata;                 /* store DOM in DateBuffer[0] */

                State++;                 /* increment to mm state */
                count++;                 /* increment character count,will be 2 */
                digit = 0;               /* set digit to zero  */
                uprintf("/");            /* and write '/' on the screen */

                continue;                /* continue for minutes */
              }
              else
              {
                uErase_And_RingTheBell();

                continue;
              }
            }
          }
          /************************* check month *************************/
          if(State == 1)
          {
            if(digit==0)
            {
              uprintf("%c", RTCdata);    /* echo 1st character */
              AsciiMSB = RTCdata;        /* store 1st byte MSB  */
              count++;                   /* increment character count,will be 3 */
              digit++;                   /* increment digit, will be 1  */

              continue;
            }
            else
            {
              uprintf("%c", RTCdata);   /* echo 2nd character */
              AsciiLSB = RTCdata;                 /* store 2nd byte LSB  */
              RTCdata = ((AsciiMSB & 0x0F) * 10); /* store nibble */
              RTCdata += (AsciiLSB & 0x0F);       /* add to nibble, integer */

              if(RTCdata >= 1 && RTCdata <=12)    /* check month range ( 1-12) */
              {
                D.Month = RTCdata;       /* store mm in time buffer */

                State++;                 /* increment to ss state */
                count++;                 /* increment character count,will be 4 */
                digit = 0;               /* set digit to zero  */
                uprintf("/");            /* and write '/' on the screen */

                continue;                /* continue for seconds */
              }
              else
              {
                uErase_And_RingTheBell();

                continue;
              }
            }
          }
          /********** check year and century *********/
          if(State == 2)
          {
            if(digit == 0)
            {
              uprintf("%c", RTCdata);    /* echo 1st character */
              AsciiMSB = RTCdata;        /* store 1st byte MSB  */

              count++;                   /* increment character count,will be 5 */
              digit++;                   /* increment digit no.  */

              continue;
            }
            if(digit == 1)
            {
              uprintf("%c", RTCdata);   /* echo 2nd character */
              AsciiLSB = RTCdata;                 /* store 2nd byte LSB  */
              RTCdata = ((AsciiMSB & 0x0F) * 10); /* store nibble */
              RTCdata += (AsciiLSB & 0x0F);       /* add to nibble, integer */

              if(RTCdata >= 0 && RTCdata <=40)   /* check century range (0-39) */
              {
                DateBuffer[0] = RTCdata;          /* store in century buffer */

                count++;                 /* increment character count,will be 6 */
                digit++;                 /* increment digit number, will be 3  */

                continue;
              }
              else
              {
                uErase_Char_With_UnderScore();
                uprintf("\7");          /* ring the bell */

                continue;
              }
            }
            /**********  check year  ************/
            if(digit == 2)
            {
              uprintf("%c", RTCdata);   /* echo 1st character */
              AsciiMSB = RTCdata;       /* store 1st byte MSB  */

              count++;                  /* increment character count,will be 7 */
              digit++;                  /* increment digit no.  */

              continue;
            }

            if(digit == 3)
            {
              uprintf("%c", RTCdata);              /* echo 2nd character */
              AsciiLSB = RTCdata;                  /* store 2nd byte LSB  */
              RTCdata = ((AsciiMSB & 0x0F) * 10);  /* store nibble */
              RTCdata += (AsciiLSB & 0x0F);        /* add to nibble, integer */

