ELSPL/STM32F4-Dev/Example Projects/Core Feature/Eg5/Drivers/BSP/stm32f4_discovery_rtc.c
              if(DateBuffer[0] == 40)
              {
                if(RTCdata <=95)              /* check year range (00-95) */
                {
                  DateBuffer[1] = RTCdata;    /* store in year buffer */
                  DateFlag = 1;               /* Time data is ready for RTC */
                    count++;                  /* increment character count,will be 8 */
                    digit++;                  /* increment digit number, will be 4  */
                    continue;
                }
                else
                {
                  uErase_Char_With_UnderScore();
                  uprintf("\7");              /* ring the bell */

                  continue;
                }
              }

              if(RTCdata <=99)                     /* check year range (00-99) */
              {
                DateBuffer[1] = RTCdata;           /* store in year buffer */
                DaysThisMonth = DaysPerMonth[D.Month- 1];
                if(Is_Leap_Year(DateBuffer[1], DateBuffer[0]) && (D.Month == 2))
                {
                  ++DaysThisMonth;
                }
                if(D.Date > DaysThisMonth)
                {
                  D.Date = DaysThisMonth;
                }
                DateFlag = 1;                      /* Time data is ready for RTC */
                count++;                           /* increment character count,will be 8 */
                digit++;                           /* increment digit number, will be 4  */

                continue;
              }
              else
              {
                uErase_Char_With_UnderScore();
                uprintf("\7");           /* ring the bell */

                continue;
              }
            }
          }
          continue;                      /* number of char is more than reqd */
          /* so go back to find the decision */
        }
        else
        {
          uprintf("%c", cp);                   /* echo character */
          uErase_Char();
          uprintf("\7");                       /* ring the bell */

          continue;
        }
      }
    }
    return(0);
}


/**
 * @brief This function disable the RTC by disabling the peripheral clock
 * @param hrtc
 *        @arg hrtc_bsp  RTC handle
 */
void BSP_RTC_MspDeInit(RTC_HandleTypeDef* hrtc)
{
  if(hrtc->Instance==RTC)
  {
    /* Peripheral clock disable */
    __HAL_RCC_RTC_DISABLE();

    /* Peripheral interrupt Deinit*/
    HAL_NVIC_DisableIRQ(RTC_WKUP_IRQn);
    HAL_NVIC_DisableIRQ(RTC_Alarm_IRQn);
    HAL_NVIC_DisableIRQ(TAMP_STAMP_IRQn);
  }
}

/**
 * @} STM32F4_DISCOVERY_RTC_Public_Functions End
 */

/**
 * @} STM32F4_DISCOVERY_RTC End
 */

 /* --------------------------------- End Of File ------------------------------ */
